АлогистикТест2/src/DataProcessors/алк_РМ_ПеремещениеПакетов/алк_РМ_ПеремещениеПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>алк_РМ_ПеремещениеПакетов</name>
  <attributes>
    <name>Бригада</name>
    <type>
      <types>CatalogRef.Бригады</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладОтправитель</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтабельОтправитель</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтабельПолучатель</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

АлогистикТест2/src/Documents/алк_Перемещение/алк_Перемещение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_Перемещение</name>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПроизводствоОборот</registerRecords>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладОтправитель</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтабельОтправитель</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтабельПолучатель</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/DataProcessors/алк_РМ_ПеремещениеПакетов/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Участок) И 
		(НЕ ЗначениеЗаполнено(Объект.Смена) ИЛИ НЕ ЗначениеЗаполнено(Объект.ДатаСмены)) Тогда
		//Заполним ДатаСмены и Смена автоматом
		ПараметрыСменыПоТекущейДате = РфпПолучениеДанныхСервер.ПолучитьПараметрыСменыПоДате(Объект.Участок);
		ЗаполнитьЗначенияСвойств(Объект, ПараметрыСменыПоТекущейДате, "ДатаСмены, Смена");
	КонецЕсли;
	
	Элементы.НомерПакета.Доступность = ЗначениеЗаполнено(Объект.Участок);
	
	ОбработатьТЧ();
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьТЧ(ОчиститьВыбранноеПеремещение = Истина)
	ОбновитьБригаду();	
	ОбновитьОстатки();
	ОбновитьПеремещения(); 	
	НомерПакетаИзменениеТекстаРедактированияНаСервере("0");
	Если ОчиститьВыбранноеПеремещение Тогда	
		ВыбранноеПеремещение = ВыбранноеПеремещение.Пустая();
		ТекущаяТЧ.Очистить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьБригаду()
	Объект.Бригада = алк_ПроизводствоСервер.ПолучитьБригадуПоСменеИУчастку(Объект.ДатаСмены, Объект.Смена, Объект.Участок);	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОстатки()
	Остатки.Параметры.УстановитьЗначениеПараметра("СтруктурнаяЕдиница", Объект.СкладОтправитель);
	Остатки.Параметры.УстановитьЗначениеПараметра("Штабель", Объект.ШтабельОтправитель);
	Остатки.Параметры.УстановитьЗначениеПараметра("Организация", Объект.Организация);
КонецПроцедуры

&НаСервере
Процедура ОбновитьПеремещения()
	ПеремещенныеПакеты.Параметры.УстановитьЗначениеПараметра("СкладОтправитель", Объект.СкладОтправитель);
	ПеремещенныеПакеты.Параметры.УстановитьЗначениеПараметра("ШтабельОтправитель", Объект.ШтабельОтправитель);
	ПеремещенныеПакеты.Параметры.УстановитьЗначениеПараметра("СкладПолучатель", Объект.СкладПолучатель);
	ПеремещенныеПакеты.Параметры.УстановитьЗначениеПараметра("ШтабельПолучатель", Объект.ШтабельПолучатель);
	ПеремещенныеПакеты.Параметры.УстановитьЗначениеПараметра("ДатаСмены", Объект.ДатаСмены);
	ПеремещенныеПакеты.Параметры.УстановитьЗначениеПараметра("Смена", Объект.Смена);
	ПеремещенныеПакеты.Параметры.УстановитьЗначениеПараметра("Участок", Объект.Участок); 
	ПеремещенныеПакеты.Параметры.УстановитьЗначениеПараметра("Организация", Объект.Организация);
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Модифицированность Тогда
		ПоказатьВопросМодифицированность();
		СтандартнаяОбработка = Ложь;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ПриОткрытииНаСервере(); 
КонецПроцедуры

&НаКлиенте
Процедура УчастокОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Модифицированность Тогда
		ПоказатьВопросМодифицированность();
		СтандартнаяОбработка = Ложь;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УчастокПриИзменении(Элемент)
	ПриОткрытииНаСервере(); 
КонецПроцедуры

#Область ПолеПодбора

&НаКлиенте
Процедура НомерПакетаИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	НомерПакетаИзменениеТекстаРедактированияНаСервере(Текст);
	НомерПакета = Текст;
КонецПроцедуры

&НаСервере
Процедура НомерПакетаИзменениеТекстаРедактированияНаСервере(Текст)
	Остатки.Параметры.УстановитьЗначениеПараметра("ПодобныйНомер", "%" + ФОРМАТ(Число(?(Текст = "", 999999, Текст)),"ЧЦ=6; ЧВН=; ЧГ=0")); //Число с лидирующими нулями
КонецПроцедуры

&НаКлиенте
Процедура НомерПакетаПриИзменении(Элемент)
	НомерПакетаИзменениеТекстаРедактированияНаСервере(НомерПакета);
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура СкладОтправительПриИзменении(Элемент)
	ОбработатьТЧ();
КонецПроцедуры

&НаКлиенте
Процедура ШтабельОтправительПриИзменении(Элемент)
	ОбработатьТЧ()
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОстатки1(Команда)
	ОбновитьОстатки();
КонецПроцедуры

&НаКлиенте
Процедура ДатаСменыПриИзменении(Элемент)
	ОбработатьТЧ();
КонецПроцедуры

&НаКлиенте
Процедура СменаПриИзменении(Элемент)
	ОбработатьТЧ();
КонецПроцедуры

&НаКлиенте
Процедура СкладПолучательПриИзменении(Элемент)
	ОбработатьТЧ()
КонецПроцедуры

&НаКлиенте
Процедура ШтабельПолучательПриИзменении(Элемент)
	ОбработатьТЧ()
КонецПроцедуры

&НаКлиенте
Процедура СкладОтправительОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Модифицированность Тогда
		ПоказатьВопросМодифицированность();
		СтандартнаяОбработка = Ложь;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ШтабельОтправительОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Модифицированность Тогда
		ПоказатьВопросМодифицированность();
		СтандартнаяОбработка = Ложь;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаСменыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Модифицированность Тогда
		ПоказатьВопросМодифицированность();
		СтандартнаяОбработка = Ложь;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СменаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Модифицированность Тогда
		ПоказатьВопросМодифицированность();
		СтандартнаяОбработка = Ложь;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СкладПолучательОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Модифицированность Тогда
		ПоказатьВопросМодифицированность();
		СтандартнаяОбработка = Ложь;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ШтабельПолучательОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Модифицированность Тогда
		ПоказатьВопросМодифицированность();
		СтандартнаяОбработка = Ложь;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОчиститьСообщения();
	Если ЗначениеЗаполнено(ВыбранноеПеремещение) И НЕ Модифицированность Тогда
		ПоказатьВопросПриВыбореОстатков(ВыбраннаяСтрока);
	Иначе
		ДобавитьСтрокуВТекущиеДанные(ВыбраннаяСтрока);
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопросПриВыбореОстатков(ВыбраннаяСтрока)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВыбраннаяСтрока", ВыбраннаяСтрока);
	
	Оповещение = Новый ОписаниеОповещения("ОбработкаОтветаПриВыбореОстатков", ЭтотОбъект, ДополнительныеПараметры);	
 	ПоказатьВопрос(Оповещение,
        "ДА - Создать новое перемещение" + Символы.ПС +"НЕТ - Добавить в текущее перемещение",
      	РежимДиалогаВопрос.ДаНетОтмена,
        0, // таймаут в секундах
        КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
        "Выбран документ перемещения" // (необ.) заголовок
    ); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтветаПриВыбореОстатков(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
    	ВыбранноеПеремещение = ВыбранноеПеремещение.Пустая();
		ТекущаяТЧ.Очистить();	
	КонецЕсли;

	Если НЕ Результат = КодВозвратаДиалога.Отмена Тогда	
		ДобавитьСтрокуВТекущиеДанные(Параметры.ВыбраннаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокуВТекущиеДанные(ВыбраннаяСтрока)

	Элементы.Остатки.ТекущаяСтрока = ВыбраннаяСтрока;//Наверное не нужна 	
	
	//Проверка на уже добавленую строк ус таким серийным номером
	Отбор = Новый Структура;
	Отбор.Вставить("СерийныйНомер", Элементы.Остатки.ТекущиеДанные.СерийныйНомер); 
	НайденыеСтроки = ТекущаяТЧ.НайтиСтроки(Отбор);
	Если НайденыеСтроки.Количество() = 0 Тогда	
		НоваяСтрока = ТекущаяТЧ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Элементы.Остатки.ТекущиеДанные); 
		Модифицированность = Истина;
	Иначе
		Сообщить("Пакет с таким серийным номером уже добавлен"); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьАктивациюПеремещения()
	Если Модифицированность Тогда
		ПоказатьВопросМодифицированность();
	ИначеЕсли НЕ Элементы.ПеремещенныеПакеты.ТекущиеДанные = Неопределено Тогда
		ТекущаяТЧ.Очистить();	
		ВыбранноеПеремещение = Элементы.ПеремещенныеПакеты.ТекущиеДанные.Перемещение;
		ЗаполнитьТекущиеДанныеПоВыбранномуПеремещению();	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПеремещенныеПакетыПриАктивизацииЯчейки(Элемент)
	ОбработатьАктивациюПеремещения()
КонецПроцедуры

Процедура ЗаполнитьТекущиеДанныеПоВыбранномуПеремещению()
	ВыбранноеПеремещениеОбъект = ВыбранноеПеремещение.ПолучитьОбъект();
	Для Каждого Запас Из ВыбранноеПеремещениеОбъект.Запасы Цикл
		НоваяСтрока = ТекущаяТЧ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Запас);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопросМодифицированность()	
	Оповещение = Новый ОписаниеОповещения("ОбработкаОтветаМодифицированность", ЭтотОбъект);	
 	ПоказатьВопрос(Оповещение,
        "Сохранить изменения?",
      	РежимДиалогаВопрос.ДаНетОтмена,
        0, // таймаут в секундах
        КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
        "Текущие данные были изменены" // (необ.) заголовок
    ); 	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтветаМодифицированность(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
    	Сохранить(Ложь);	
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		ТекущаяТЧ.Очистить();
		Модифицированность = Ложь;
		ОбработатьТЧ(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	Если ПроверитьЗаполнение() Тогда
		Если ЗначениеЗаполнено(ВыбранноеПеремещение) Тогда
			ПерезаписатьВыбранноеПеремещениеСТекущимиДанными();		
		Иначе
			СоздатьНовоеПеремещениеПоТекущимДанным();
		КонецЕсли;
		
		ОбработатьТЧ(Ложь);
	КонецЕсли;
КонецПроцедуры

Процедура ПерезаписатьВыбранноеПеремещениеСТекущимиДанными()
	ВыбранноеПеремещениеОбъект = ВыбранноеПеремещение.ПолучитьОбъект();
	ВыбранноеПеремещениеОбъект.Запасы.Очистить();
	Для Каждого Стр Из ТекущаяТЧ Цикл
		НоваяСтрока = ВыбранноеПеремещениеОбъект.Запасы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
	КонецЦикла;
	
	Попытка
		ВыбранноеПеремещениеОбъект.Записать(РежимЗаписиДокумента.Проведение);
		//ТекущаяТЧ.Очистить();
		Модифицированность = Ложь;
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;	
КонецПроцедуры

Процедура СоздатьНовоеПеремещениеПоТекущимДанным()
	НовыйДокумент = Документы.алк_Перемещение.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(НовыйДокумент, Объект);
	Для Каждого Стр Из ТекущаяТЧ Цикл
		НоваяСтрока = НовыйДокумент.Запасы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
	КонецЦикла;
	
	Попытка
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		//ТекущаяТЧ.Очистить();
		ВыбранноеПеремещение = НовыйДокумент.Ссылка;
		Модифицированность = Ложь;
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;	
КонецПроцедуры

&НаКлиенте
Процедура ТекущаяТЧПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВсеОстатки(Команда)
	Если ПроверитьЗаполнение() Тогда
		ОбработатьТЧ(Ложь);
		Если ТекущаяТЧ.Количество() > 0 Тогда		
			ПоказатьВопросОчисткиТекущихДанных();	
		Иначе
			ЗаполнитьВсеОстаткиНаСервере();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопросОчисткиТекущихДанных()	
	Оповещение = Новый ОписаниеОповещения("ОбработкаОтветаОчисткиТекущихДанных", ЭтотОбъект);	
 	ПоказатьВопрос(Оповещение,
        "Очистить текущие данные перед заполнением?",
      	РежимДиалогаВопрос.ДаНетОтмена,
        0, // таймаут в секундах
        КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
        "Заполнить остатками" // (необ.) заголовок
    ); 	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтветаОчисткиТекущихДанных(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ТекущаяТЧ.Очистить();
		ЗаполнитьВсеОстаткиНаСервере();
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		ЗаполнитьВсеОстаткиНаСервере();		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьВсеОстаткиНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ОстаткиЗапасовОстатки.СерийныйНомер,
		|	алк_ОстаткиЗапасовОстатки.Характеристика,
		|	алк_ОстаткиЗапасовОстатки.КоличествоОстаток КАК Количество,
		|	алк_ОстаткиЗапасовОстатки.Номенклатура
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
		|			,
		|			СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		|				И Штабель = &Штабель
		|				И СерийныйНомер.Наименование ПОДОБНО &ПодобныйНомер
		|				И Организация = &Организация) КАК алк_ОстаткиЗапасовОстатки";
	
	
	Запрос.УстановитьПараметр("ПодобныйНомер", "%" + ФОРМАТ(Число(?(НомерПакета = "", 999999, НомерПакета)),"ЧЦ=6; ЧВН=; ЧГ=0"));		
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Объект.СкладОтправитель);
	Запрос.УстановитьПараметр("Штабель", Объект.ШтабельОтправитель);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("СерийныйНомер", ВыборкаДетальныеЗаписи.СерийныйНомер); 
		НайденыеСтроки = ТекущаяТЧ.НайтиСтроки(Отбор);
		Если НайденыеСтроки.Количество() = 0 Тогда	
			НоваяСтрока = ТекущаяТЧ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи); 
			Модифицированность = Истина;
		Иначе
			Сообщить("Пакет " + ВыборкаДетальныеЗаписи.СерийныйНомер + " уже был добавлен"); 
		КонецЕсли;			
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПеремещенныеПакетыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
    ПоказатьЗначение(, Элементы.ПеремещенныеПакеты.ТекущиеДанные.Перемещение);
КонецПроцедуры
